_posts/2019-06-07-the-strange-obsession-with-5g.html
---
layout: post
title: The Strange Obsession With 5G
excerpt: Beware technology that becomes a symbol of everything else
---

<p>
There's a strange obsession with <a href="https://en.wikipedia.org/wiki/5G">5G</a> these days that, as far as I can tell, has little to do with the technology itself. The US is <a href="https://www.cnet.com/news/huawei-ban-full-timeline-on-how-and-why-its-phones-are-under-fire/">banning</a> not only Huawei 5G equipment but preventing US companies from supplying components to the Chinese company. Secretary of State Pompeo has <a href="https://www.nytimes.com/2019/05/08/technology/pompeo-huawei-britain.html">warned the UK</a> in no uncertain terms that allowing Huawei to build their 5G network would bring about the end of Britain's participation in <a href="https://en.wikipedia.org/wiki/Five_Eyes">Five Eyes</a>. This all seems quite sudden and extreme.
</p>

<p>
First of all, what is 5G? It's a new standard for wireless communication that uses <a href="https://www.lifewire.com/5g-spectrum-frequencies-4579825">higher-frequency signals</a>. Such standards tend to be very complex, especially as corporations (or even gov'ts) have tremendous incentive to bend the standard their way to give themselves an advantage. The physics, however, is simple enough: the speed with which information can be transmitted over an electromagnetic wave is directly proportional to the wave's frequency; higher frequency, faster information transmission. The tradeoff<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> is that higher-frequency waves are more easily absorbed by trees, buildings, and even the air itself, so range is dramatically decreased and more radio transmitters are needed.
</p>

<p>
So what's the big deal? Sure, it's nice to stream video faster on the phone, but how did this suddenly become a national security issue? Even if <a href="https://www.youtube.com/watch?v=faLH3crTnfE">robots can be more smoothly controlled</a>, is it really so serious that the Secretary of State must get involved?
</p>

<p>
First, the espionage issue should be treated separately from the 5G issue. The sticking point there is over Chinese involvement in British telecom networks, not the particular technology. The nature of communication (or really anything IT) is that if an outside party gets access to any part of the chain, they could compromise the entire system. So it's no wonder the US is determined to make sure Five Eyes maintains communication integrity by keeping Chinese equipment out.
</p>

<p>
But that still doesn't explain the focus on 5G itself. While companies are eager to promise all sorts of technological revolutions stemming from 5G, from internet of things (itself an old canard<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>) to self-driving cars (which <i>may</i> come sooner than nuclear fusion), I've a few theories as to why 5G has suddenly become a hot topic:
</p>

<ol class="org-ol">
<li>The media's <a href="https://www.youtube.com/watch?v=CEQTo9usai4">obsession with horse races</a>, especially ones where the US seems to be lagging.
<ul class="org-ul">
<li>See: <a href="https://www.youtube.com/watch?v=zUTmKiKHVOM">Sputnik</a>, Japan's<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> <a href="https://en.wikipedia.org/wiki/Fifth_generation_computer">Fifth Generation Computer</a>.</li>
</ul></li>
<li>The defense establishment's eagerness to create a narrative of American vulnerability to secure&#x2013;what else&#x2013;funding.
<ul class="org-ul">
<li>Any buzzword senators don't understand would do, and 5G's as good as any other.</li>
</ul></li>
<li>The lack of real results from 5G deployment<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>, which allows the narrative of revolutionary technological change to be maintained.
<ul class="org-ul">
<li>Years from now, when the real, mundane results are clear, we'll have moved on to another tech buzzword</li>
</ul></li>
</ol>

<p>
All this is to say that 5G has become much more than a technology: it's a symbol of everything from our dreams of technological utopia to fears over US-China competition<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>. And if there's one rule we should observe about technology, it's this:
</p>

<blockquote>
<p>
When a technology ceases to be evaluated on its own merits and instead becomes a symbol of everything else, run the other way.
</p>
</blockquote>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
In engineering, there are <i>always</i> tradeoffs
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Beyond talking microwaves and $100 lightbulbs, IoT has found genuine value in domains like oilfield monitoring, but that never seems to be what its advocates, well, advocate.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Anyone interested in US-China relations, particularly topics like industrial espionage, should read Michael Crichton's <a href="https://en.wikipedia.org/wiki/Rising_Sun_(novel)">Rising Sun</a>, mentally replacing every instance of "Japan" with "China"
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
5G is slowly rolling out in places like <a href="https://www.cnet.com/news/verizon-5g-map-network-now-live-in-chicago-and-minneapolis-limited/">Chicago and Minneapolis</a>, but the immediate performance improvement over 4G is dubious, and limited range is a significant drawback
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Personally, I find the US-China rivalry narrative hugely overblown. Geopolitical analyst Peter Zeihan <a href="https://annual.cfainstitute.org/2019/05/16/a-painful-realignment-peter-zeihan-on-brexit-fallout/chin">sums it up</a> better than I could.
</p></div></div>


</div>
</div>
